til.html
<!DOCTYPE html><html><head><!--  --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Today i learned</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
We can also name it <code>Mini articles</code>
</p>

<div id="outline-container-org28418b9" class="outline-2">
<h2 id="org28418b9">2025</h2>
<div class="outline-text-2" id="text-org28418b9">
</div>
<div id="outline-container-org17dc428" class="outline-3">
<h3 id="org17dc428">Access google email as RSS</h3>
<div class="outline-text-3" id="text-org17dc428">
<ul class="org-ul">
<li>Create app password using following link: <a href="https://myaccount.google.com/apppasswords">https://myaccount.google.com/apppasswords</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">curl -u <span class="org-string">"Username:App password"</span> https://mail.google.com/mail/feed/atom
</pre>
</div>
<p>
If you email is <b><b>emacs@gmail.com</b></b> and app password generated by google is <b><b>emacs is awesome</b></b>
</p>
<div class="org-src-container">
<pre class="src src-shell">curl -u <span class="org-string">"emacs:emacs is awesome"</span> https://mail.google.com/mail/feed/atom
</pre>
</div>
</div>
</div>

<div id="outline-container-org2e9e84c" class="outline-3">
<h3 id="org2e9e84c">Google colab to finetune llm</h3>
<div class="outline-text-3" id="text-org2e9e84c">
<p>
During the Foss United March 2025 meetup i came to know that llm can
be finetuned using google colab. 
</p>
<ul class="org-ul">
<li><a href="https://github.com/poloclub/Fine-tuning-LLMs">https://github.com/poloclub/Fine-tuning-LLMs</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5a2b39b" class="outline-3">
<h3 id="org5a2b39b">Open DNS family shield - Make internet browsing safer for whole family</h3>
<div class="outline-text-3" id="text-org5a2b39b">
<ul class="org-ul">
<li><a href="https://www.opendns.com/setupguide/#familyshield">https://www.opendns.com/setupguide/#familyshield</a></li>
<li>Blocks most of the adult websites</li>
</ul>
<pre class="example" id="org8c91f9a">
208.67.222.123, 208.67.220.123
</pre>
</div>
</div>

<div id="outline-container-org2b4a186" class="outline-3">
<h3 id="org2b4a186">Emacs Copy, Cut (Kill), Paste (Yank) Trick</h3>
<div class="outline-text-3" id="text-org2b4a186">
<ul class="org-ul">
<li>Assume you want to copy or cut part of a paragraph, but not the entire thing.</li>
<li>Go to the start of the text you want to select and press C-space twice.</li>
<li>Then, move to the end of the text you want to operate on and press C-w to cut (kill) or M-w to copy.</li>
<li>This method works in reverse as well, which is quite interesting.</li>
<li>Normally, I select the text I want and then press the copy or cut command, but this approach changes the way you do it completely.</li>
</ul>
</div>
</div>

<div id="outline-container-org8e13491" class="outline-3">
<h3 id="org8e13491">CSS before trick</h3>
<div class="outline-text-3" id="text-org8e13491">
<ul class="org-ul">
<li>If you need to add any whitespace before text use the below logic</li>
</ul>
<div class="org-src-container">
<pre class="src src-css"><span class="org-css-selector">h2</span> {
  <span class="org-css-property">text-decoration</span>: underline;
}

<span class="org-css-selector">h2.space::after</span> {
  <span class="org-css-property">content</span>: <span class="org-string">" "</span>;
  <span class="org-css-property">white-space</span>: pre;
}
</pre>
</div>
</div>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
